---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureScaleLock
source: html/c1df6985-e0c1-4af9-9529-6753ab4393b4.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureScaleLock Property

The property labeled "Scale Lock" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureScaleLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".